---
kind: property
id: P:Autodesk.Revit.DB.RenderingSettings.LightingSource
source: html/91f3de94-ec53-99f6-73c0-e79e987a8729.htm
---
# Autodesk.Revit.DB.RenderingSettings.LightingSource Property

The lighting scheme type.

## Syntax (C#)
```csharp
public LightingSource LightingSource { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration